; domain
;; Molgen domain in ADL.

;; (c) 1993,1994 Copyright (c) University of Washington
;;  Written by Tony Barrett.

(define (domain molgen-adl)
  (:requirements :adl :equality :conditional-effects
		 :existential-preconditions)

  (:constants LINKER)
  (:predicates (mRNA ?x)
	       (molecule ?x)
	       (connected-cDNA-mRNA ?x)
	       (single-strand ?x)
	       (hair-pin ?x)
	       (double-strand ?x)
	       (cleavable ?x)
	       (cleaved ?x)
	       (bacterium ?x)
	       (accepts ?x ?y)
	       (contains ?x ?y)
	       (antibiotic ?x)
	       (pure ?x)
	       (resists ?x ?y))

  ;; steps for building DNA molecules from mRNA
  (:action reverse-transcribe
    :parameters (?x)
    :precondition (mRNA ?x)
    :effect (connected-cDNA-mRNA ?x))

  (:action separate
    :parameters (?x)
    :precondition (connected-cDNA-mRNA ?x)
    :effect (and (single-strand ?x)
		 (not (connected-cDNA-mRNA ?x))))

  (:action polymerize
    :parameters (?x)
    :precondition (single-strand ?x)
    :effect (and (hair-pin ?x)
		 (not (single-strand ?x))))

  (:action digest
    :parameters (?x)
    :precondition (hair-pin ?x)
    :effect (and (double-strand ?x)
		 (not (hair-pin ?x))))

  ;; steps for splicing DNA molecules
  (:action ligate
    :parameters (?x ?y)
    :precondition (not (= ?x ?y))
    :effect (and (when (and (double-strand ?y) (= ?x LINKER))
		   (cleavable ?y))
		 (when (and (cleaved ?x) (cleaved ?y) (not (= ?x LINKER)))
		   (and (contains ?x ?y) (cleavable ?y)
			(not (cleaved ?x)) (not (cleaved ?y))))))

  (:action cleave
    :parameters (?x)
    :precondition (cleavable ?x)
    :effect (and (cleaved ?x)
		 (not (cleavable ?x))))

  ;; step for inserting a molecule into an organism
  (:action transform
    :parameters (?x ?y)
    :precondition (and (bacterium ?y) 
		       (not (= ?x ?y))
		       (cleavable ?x) ; molecule must be whole
		       (accepts ?x ?y)) ; is molecule accepted?
    :effect (and (contains ?x ?y)
		 (not (cleavable ?x))))

  ;; purify a culture with an antibiotic
  (:action screen
    :parameters (?x ?y ?z)
    :precondition (and (bacterium ?x) (antibiotic ?z) 
		       (not (= ?x ?y)) (not (= ?y ?z)) (not (= ?x ?z))
		       (resists ?z ?y)(contains ?y ?x))
    :effect (pure ?x))
  )

; problem
;; Molgen's rat insulin problem (ADL version).

(define (problem rat-insulin-adl)
  (:domain molgen-adl)
  (:objects insulin-gene e-coli-exosome junk-exosome
	    e-coli junk antibiotic-1)
  (:init (molecule insulin-gene)
	 (molecule e-coli-exosome)
	 (molecule junk-exosome) (molecule linker)
	 (bacterium e-coli) (bacterium junk)
	 (antibiotic antibiotic-1)
	 (mRNA insulin-gene)
	 (cleavable e-coli-exosome)
	 (cleavable junk-exosome)
	 (accepts junk-exosome junk)
	 (accepts e-coli-exosome e-coli)
	 (resists antibiotic-1 e-coli-exosome))
;;  (:goal (exists (?y ?x)
;;		 (and (bacterium ?y) 
;;		      (molecule ?x)
;;		      (contains insulin-gene ?x)
;;		      (contains ?x ?y)
;;		      (pure ?y))))
  ;; For planners that do not support existentially quantified goals,
  ;; one can cheat a bit and use the following goal instead:
    (:goal (and (contains insulin-gene e-coli-exosome)
  	      (contains e-coli-exosome e-coli)
  	      (pure e-coli)))
  )

; plan
1. (cleave e-coli-exosome)
   deleted: (cleavable e-coli-exosome)
   added: (cleaved e-coli-exosome)
   goals met: 0 of 3
2. (reverse-transcribe insulin-gene)
   added: (connected-cdna-mrna insulin-gene)
   goals met: 0 of 3
3. (separate insulin-gene)
   deleted: (connected-cdna-mrna insulin-gene)
   added: (single-strand insulin-gene)
   goals met: 0 of 3
4. (polymerize insulin-gene)
   deleted: (single-strand insulin-gene)
   added: (hair-pin insulin-gene)
   goals met: 0 of 3
5. (digest insulin-gene)
   deleted: (hair-pin insulin-gene)
   added: (double-strand insulin-gene)
   goals met: 0 of 3
6. (ligate linker insulin-gene)
   added: (cleavable insulin-gene)
   goals met: 0 of 3
7. (cleave insulin-gene)
   deleted: (cleavable insulin-gene)
   added: (cleaved insulin-gene)
   goals met: 0 of 3
8. (ligate insulin-gene e-coli-exosome)
   deleted: (cleaved insulin-gene) (cleaved e-coli-exosome)
   added: (contains insulin-gene e-coli-exosome) (cleavable e-coli-exosome)
   goals met: 1 of 3
9. (transform e-coli-exosome e-coli)
   deleted: (cleavable e-coli-exosome)
   added: (contains e-coli-exosome e-coli)
   goals met: 2 of 3
10. (screen e-coli e-coli-exosome antibiotic-1)
   added: (pure e-coli)
   goals met: 3 of 3
